# 1.简单赋值运算符：=
name = 'abc'    # 定义变量，将‘abc’赋值给name
name = 'xyz'    # 重新赋值，将'xyz'赋值给name

# =的右边只要是一个数据或者可以计算结果的表达式，都可以给=左边的变量进行赋值
n1 = True
print(n1)
n2 = 2 + 3 * 2 - 10 + 2 ** 10
print(n2)  # 1022

# 【面试题】
# 错误写法
# n3 = (n2 = n1 + 10)
# print(n3)
'''
原因：
    n2 = n1 + 10-----》将n1 + 10的结果赋值给n2
    n3 = (n2 = n1 + 10)-----》只是将n1+10的结果赋值给了n2，但是n2 = n1 + 10整体没有结果，无法给n3赋值
'''
# 正确写法一
# n2 = n1 + 10
# n3 = n2
# print(n3)

# 正确写法二
n3 = (n2 == n1 + 10)
print(n3)  # False

# 2.复合赋值运算符：+=  -=  *=  /=  //=  %=  **=
m1 = 3
m1 = 9    # 重新赋值
print(m1)

n1 = 3
n1 += 9  # 等价于n1 = n1 + 9,先计算n1 + 9,然后给n1进行重新赋值
print(n1)

# 问题1：一定要书写成+=，而不是+ =
a = 3
a *= 10
print(a)

# 问题2：在使用复合赋值运算符时，一定要先定义变量，然后才使用
# b += 1   # NameError: name 'b' is not defined
