# 1.print()为空,作用是换行
print()
print()

# 2.输出单个数据
print('hello world')   # 字符串
print(10)   # 数字：整型【整数】
print(34.19)  # 数字：浮点型【小数】

# 3.输出多个
# 注意：书写的时候，多个数据之间用逗号分隔,但是运行的结果中【控制台上】，多个数据之间使用空格分隔的
print('abc',45,23,67.13,'56')

# 4.sep:分隔符，用于一个print输出多个数据时，在控制台上显示的结果中，多个数据之间的分隔符，默认为空格，也可以自定义
print('abc',45,23,67.13,'56')   # abc 45 23 67.13 56
print('abc',45,23,67.13,'56',sep='~~~')  # abc~~~45~~~23~~~67.13~~~56
print('abc',45,23,67.13,'56',sep='*')   # abc*45*23*67.13*56

# 5.end:结束符，用于一个print结束之后的结束符，默认为\n,\n表示换行，也可以自定义
print('hello world~~~~~11111')
print('hello world~~~~~~22222')

print('hello world~~~~~11111',end='&&&&')
print('hello world~~~~~~22222')

print('abc',45,23,67.13,'56',end='~~~~~~',sep='*')